下注前余额:315  下注后余额:295  下注20   结果{0: '7', 1: '7', 2: '0'}    结算余额:295
下注前余额:295  下注后余额:285  下注10   结果{0: '3', 1: '7', 2: '-4000'}结算余额:285
下注前余额:285  下注后余额:255  下注30   结果{0: '1', 1: '8', 2: '-6500'}结算余额:255
下注前余额:255  下注后余额:235  下注20   结果{0: '9', 1: '1', 2: '6000'} 结算余额:235
下注前余额:235  下注后余额:195  下注40   结果                            结算余额:195
下注前余额:195  下注后余额:145  下注50   结果                            结算余额:145
下注前余额:145  下注后余额:105  下注40   结果                            结算余额:165
下注前余额:165  下注后余额:135  下注30   结果                            结算余额: